[
    {
        "iClass":0,
        "iIndex":1,
        "sQuestion":"Mr. Smith had 6 cookies. Suzy gave him 3 more cookies. How many cookies does Mr. Smith have now?\n"
    },
    {
        "iClass":0,
        "iIndex":2,
        "sQuestion":"Mr. Smith had 4 cookies. Suzy gave him some more. Then, Mr. Smith had 7 cookies. How many cookies did Suzy give Mr. Smith?\n"
    },
    {
        "iClass":0,
        "iIndex":3,
        "sQuestion":"Mr. Smith had some cookies. Suzy gave him 4 more cookies. Then, he had 6 cookies. How many cookies did Mr. Smith start with?\n"
    },
    {
        "iClass":0,
        "iIndex":4,
        "sQuestion":"You have 4 books to read. You get 3 more books from the library. How many books do you have now?\n"
    },
    {
        "iClass":0,
        "iIndex":5,
        "sQuestion":"Robin has 98 toy cars. Her parents gave her 45 more toy cars for her birthday. How many toy cars will she have then?\n"
    },
    {
        "iClass":0,
        "iIndex":6,
        "sQuestion":"There are 320 boys in a club. 29 girls join the club. How many children are in the club altogether?\n"
    },
    {
        "iClass":0,
        "iIndex":7,
        "sQuestion":"Jane gave 10 pieces of candy to Sam. Fred gave Sam 6 pieces of gum. Mary gave Sam 12 pieces of gum. How many pieces of gum does Sam have now?\n"
    },
    {
        "iClass":0,
        "iIndex":8,
        "sQuestion":"Kristin had 17 apples. How many more apples will she need to have 39 apples all together?\n"
    },
    {
        "iClass":0,
        "iIndex":9,
        "sQuestion":"Eric has 72 golf balls. He finds some more in the basement. Now Eric has 183 golf balls. How many golf balls did Eric find in the basement?\n"
    },
    {
        "iClass":0,
        "iIndex":10,
        "sQuestion":"Columbus saw 25 whales in the ocean. How many more whales will he need to see to make it 3 dozen whales all together?\n"
    },
    {
        "iClass":0,
        "iIndex":11,
        "sQuestion":"There were 450 kids in the school. Some more kids came to the school. Now there are 920 kids at the school. How many more kids came to the school?\n"
    },
    {
        "iClass":0,
        "iIndex":12,
        "sQuestion":"Clifford has some bones. Emily gave him 23 more bones. Now Clifford has 46 bones. How many bones did Clifford have to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":13,
        "sQuestion":"Mrs. Wistrom saw some ducks. Then she saw 156 more ducks. All together, Mrs. Wistrom saw 234 ducks. How many ducks did she see to begin with?\n"
    },
    {
        "iClass":0,
        "iIndex":14,
        "sQuestion":"Mom had baked some cookies. Then she baked 4 dozen more cookies. All together, mom has baked 58 cookies. How many cookies did mom bake to begin with?\n"
    },
    {
        "iClass":0,
        "iIndex":15,
        "sQuestion":"Jeff had some leaves in a bag. Then he found 16 more leaves, and put those in the bag. Now Jeff has 76 leaves. How many leaves did Jeff find to begin with?\n"
    },
    {
        "iClass":0,
        "iIndex":16,
        "sQuestion":"Jessica had 14 toy cars. She lost 11 of the cars. How many cars does she have left?\n"
    },
    {
        "iClass":0,
        "iIndex":17,
        "sQuestion":"Melissa had 78 pumpkin seeds. She gave 23 of them to her brother. How many pumpkin seeds does Melissa have left?\n"
    },
    {
        "iClass":0,
        "iIndex":18,
        "sQuestion":"There were 156 ornaments on the tree. 120 of the ornaments fell off the tree. How many ornaments are left on the tree?\n"
    },
    {
        "iClass":0,
        "iIndex":19,
        "sQuestion":"Dan has 386 papers in his desk. He threw away 17 of them. How many papers does Dan have left in his desk?\n"
    },
    {
        "iClass":0,
        "iIndex":20,
        "sQuestion":"Mikey had 16 leaves. Some of her leaves blew away. Now she has 7 leaves left. How many of her leaves blew away?\n"
    },
    {
        "iClass":0,
        "iIndex":21,
        "sQuestion":"Sara had 99 goldfish. She gave some away. Now she has 32 goldfish left. How many goldfish did Sara give away?\n"
    },
    {
        "iClass":0,
        "iIndex":22,
        "sQuestion":"320 children wore their Halloween costumes to school. Some of the children took their costumes off at recess. There were 210 children left wearing costumes. How many children took their costumes off at recess?\n"
    },
    {
        "iClass":0,
        "iIndex":23,
        "sQuestion":"There were 42 cookies on a plate. Dad ate some of the cookies. Now there are 29 cookies left on the plate. How many cookies did Dad eat?\n"
    },
    {
        "iClass":0,
        "iIndex":24,
        "sQuestion":"Ashley had some guppies. She gave 28 guppies to Timmy. Now Ashley has 12 guppies left. How many guppies did Ashley have to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":25,
        "sQuestion":"Ryan had some trick-or-treat candy. He gave 123 pieces of candy to his sister. Now Ryan has 100 pieces of candy left. How many pieces of candy did Ryan have to begin with?\n"
    },
    {
        "iClass":0,
        "iIndex":26,
        "sQuestion":"Mrs. Wistrom had some pencils. She lost 24 of them. Now she has 6 left. How many pencils did Mrs. Wistrom have to begin with?\n"
    },
    {
        "iClass":0,
        "iIndex":27,
        "sQuestion":"A clown had some balloons. 56 of the balloons floated away. Now the clown has 45 balloons left. How many balloons did the clown have to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":28,
        "sQuestion":"Grandmother had 5 strawberries. Grandfather gave her 8 more strawberries. How many strawberries does Grandmother have now?\n"
    },
    {
        "iClass":0,
        "iIndex":29,
        "sQuestion":"Grandmother had 5 strawberries. Grandfather gave her some more. Then Grandmother had 13 strawberries. How many strawberries did Grandfather give Grandmother? \n"
    },
    {
        "iClass":0,
        "iIndex":30,
        "sQuestion":"Grandmother had some strawberries, Grandfather gave her 8 more. Then she had 13=strawberries. How many strawberries did Grandmother have before Grandfather gave her any?\n"
    },
    {
        "iClass":0,
        "iIndex":31,
        "sQuestion":"Grandfather had 13 strawberries. He gave 5 strawberries to Grandmother. How many strawberries does Grandfather have left? \n"
    },
    {
        "iClass":0,
        "iIndex":32,
        "sQuestion":"Grandfather had 13 strawberries. He gave some to Grandmother. Now he has 5 strawberries left. How many strawberries did Grandfather give Grandmother?\n"
    },
    {
        "iClass":0,
        "iIndex":33,
        "sQuestion":"Grandfather had some strawberries. He gave 5 to Grandmother. Now he has 8 strawberries left. How many strawberries did Grandfather have before he gave any to Grandmother?\n"
    },
    {
        "iClass":0,
        "iIndex":34,
        "sQuestion":"Connie had 5 marbles. Juan gave her 8 more marbles. How many marbles does Connie have all together?\n"
    },
    {
        "iClass":0,
        "iIndex":35,
        "sQuestion":"Connie has 5 marbles. How many more marbles does she need to have 13 marbles all together?\n"
    },
    {
        "iClass":0,
        "iIndex":36,
        "sQuestion":"Connie had some marbles. Juan gave her 8 more marbles. Now she has 13 marbles. How many marbles did Connie have to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":37,
        "sQuestion":"Connie had 13 marbles. She gave 8 to Juan. How many marbles does Connie have left? \n"
    },
    {
        "iClass":0,
        "iIndex":38,
        "sQuestion":"Connie had 13 marbles. She gave some to Juan. Now she has 5 marbles left. How many marbles did Connie give to Juan? \n"
    },
    {
        "iClass":0,
        "iIndex":39,
        "sQuestion":"Connie had some marbles. She gave 8 to Juan. Now she has 5 marbles left. How many marbles did Connie have to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":40,
        "sQuestion":"Jacob had 4 rocks in his collection.  Joshua gave him some more rocks to add to his collection.  Now Jacob has 7 rocks.  How many rocks did Joshua give him?  \n"
    },
    {
        "iClass":0,
        "iIndex":41,
        "sQuestion":"Roberto has some quarters.  Antonio gave him 4.  Now he has 9 quarters.  How many quarters did he already have? \n"
    },
    {
        "iClass":0,
        "iIndex":42,
        "sQuestion":"Paulina has 5 rings on her fingers.  She got 2 more rings on her birthday.  How many rings does Paulina have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":43,
        "sQuestion":"At Thanksgiving dinner, I ate 3 rolls before dinner and 2 rolls with dinner.  How many rolls did I eat?  \n"
    },
    {
        "iClass":0,
        "iIndex":44,
        "sQuestion":"Kristi had 6 ornaments to put on our tree.  Chad gave Kristi his ornaments to put on the tree too.  There are 12 ornaments on the tree.  How many ornaments did Chad give Kristi? \n"
    },
    {
        "iClass":0,
        "iIndex":45,
        "sQuestion":"There were 5 turkeys strutting.  6 more turkeys joined them.  How many turkeys are there all together? \n"
    },
    {
        "iClass":0,
        "iIndex":46,
        "sQuestion":"There were 9 reindeer on my roof.  Some reindeer flew down to the ground to play in the snow.  3 reindeer remained on the roof.  How many are playing in the snow? \n"
    },
    {
        "iClass":0,
        "iIndex":47,
        "sQuestion":"8 snowmen played in the snow.  Some elves come to play with them.  Now there are 10 playing in the snow.  How many elves are there?  \n"
    },
    {
        "iClass":0,
        "iIndex":48,
        "sQuestion":"There are 3 turkeys in a tree.  4 more turkeys came to the tree.  How many turkeys are in the tree now?  \n"
    },
    {
        "iClass":0,
        "iIndex":49,
        "sQuestion":"There are some turkeys in the tree.  4 more turkeys came to the tree.  Now there are 7 turkeys in the tree.  How many turkeys were on the tree at first?  \n"
    },
    {
        "iClass":0,
        "iIndex":50,
        "sQuestion":"The pilgrims had some pies.  They gave 6 pies to their friends the 1st Americans.  Now they have 4 pies.  How many pies did they have to begin with? \n"
    },
    {
        "iClass":0,
        "iIndex":51,
        "sQuestion":"Debbie has 4 pieces of bubble gum.  Dan gave her 3 more pieces.  How many does she have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":52,
        "sQuestion":"Mary has 6 nickels in her pocket.  She lost some.  Now she has 2 nickels left.  How many did she lose?  \n"
    },
    {
        "iClass":0,
        "iIndex":53,
        "sQuestion":"Sofia had some cookies in her lunchbox.  She gave 3 cookies to Eydie.  Now she has 6 cookies left.  How many cookies did she have to start?  \n"
    },
    {
        "iClass":0,
        "iIndex":54,
        "sQuestion":"Marc had 7 toy cars.  He gave 1 to Tom.   How many did he have left?  \n"
    },
    {
        "iClass":0,
        "iIndex":55,
        "sQuestion":"There was one flower in the garden.  Two more flowers grew.  How many flowers are in the garden?  \n"
    },
    {
        "iClass":0,
        "iIndex":56,
        "sQuestion":"Billy had 3 blocks.  He lost 1 block.  How many does he have left?  \n"
    },
    {
        "iClass":0,
        "iIndex":57,
        "sQuestion":"Carlos had 5 cookies.  He ate some.  Now he has 2 cookies.  How many cookies did he eat? \n"
    },
    {
        "iClass":0,
        "iIndex":58,
        "sQuestion":"Alexandra has 3 pattern blocks.  She picks up 2 more.  How many does she have in all?  \n"
    },
    {
        "iClass":0,
        "iIndex":59,
        "sQuestion":"Ho has 3 balls.  His teacher gave him 1 more.  How many balls does he have in all?  \n"
    },
    {
        "iClass":0,
        "iIndex":60,
        "sQuestion":"Ina had 5 chocolate milks.  She drank 2.  How many does she have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":61,
        "sQuestion":"Dylan has 5 pencils.  He drops 2.  How many does he have left?  \n"
    },
    {
        "iClass":0,
        "iIndex":62,
        "sQuestion":"Diego had 10 seashells in his pocket. He gave 5 seashells to his little sister.  How many seashells are left in his pocket?  \n"
    },
    {
        "iClass":0,
        "iIndex":63,
        "sQuestion":"Samuel has 9 gumballs.  He gives some to Matthew.  Now he has 5 gumballs.  How many gumballs did he give to Matthew?  \n"
    },
    {
        "iClass":0,
        "iIndex":64,
        "sQuestion":"Nate put 6 cars in a box.  His friend added some more cars to the box.  Now there are 9 cars in the box.  How many cars did his friend add to the box?  \n"
    },
    {
        "iClass":0,
        "iIndex":65,
        "sQuestion":"Five children are painting.  Two more came to join in.  How many children are painting?  \n"
    },
    {
        "iClass":0,
        "iIndex":66,
        "sQuestion":"3 children are reading books on the carpet.  2 more came to join in.  How many children are now reading books?  \n"
    },
    {
        "iClass":0,
        "iIndex":67,
        "sQuestion":"6 children were eating crackers.  4 more children join in.  How many children are eating crackers?  \n"
    },
    {
        "iClass":0,
        "iIndex":68,
        "sQuestion":"5 children are in line for recess.  2 children leave the line to use the restroom.  How many children are left in line for recess? \n"
    },
    {
        "iClass":0,
        "iIndex":69,
        "sQuestion":"4 children are working at the computers.  1 child went to the nurse.  How many children are still working on the computers? \n"
    },
    {
        "iClass":0,
        "iIndex":70,
        "sQuestion":"Today is October 25th. How many days until Halloween? \n"
    },
    {
        "iClass":0,
        "iIndex":71,
        "sQuestion":"Yesterday was the 49th day of school.  How many days have we been in school?  \n"
    },
    {
        "iClass":0,
        "iIndex":72,
        "sQuestion":"18 people are eating lunch.  7 people are buying lunch.  How many people brought cold lunch?  \n"
    },
    {
        "iClass":0,
        "iIndex":73,
        "sQuestion":"3 children are playing in the sandbox.  2 more children go in the sandbox.  How many kids are in the sandbox now?  \n"
    },
    {
        "iClass":0,
        "iIndex":74,
        "sQuestion":"Jesus has animal crackers.  Brittney gave him 5 more.  Now he has 10 animal crackers.  How many did Jesus have to start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":75,
        "sQuestion":"Victoria had 5 Dragon Dollars.  She used 3 to buy a prize.  How many Dragon Dollars does she have left?  \n"
    },
    {
        "iClass":0,
        "iIndex":76,
        "sQuestion":"Irene has 5 juice boxes.  Her mom brings Irene 5 more.  How many does Irene have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":77,
        "sQuestion":"There are 5 apples in a tree.  Some fell out of the tree.  Now there are 3 left in the tree.  How many fell out of the tree?  \n"
    },
    {
        "iClass":0,
        "iIndex":78,
        "sQuestion":"Jordan went to the fair.  She won 7 beta fish.  She gave 2 fish to her teacher.   How many fish does Jordan have left?\n"
    },
    {
        "iClass":0,
        "iIndex":79,
        "sQuestion":"Four Pooh Pals were on the playground.  Two busy bees joined them.  How many kindergarteners are playing?  \n"
    },
    {
        "iClass":0,
        "iIndex":80,
        "sQuestion":"Tammy has four dogs.  Two went outside.  How many stayed inside? \n"
    },
    {
        "iClass":0,
        "iIndex":81,
        "sQuestion":"There are 9 children in Mrs. Clarks class.  3 are absent.  How many are in class today?  \n"
    },
    {
        "iClass":0,
        "iIndex":82,
        "sQuestion":"Karen has 6 crayons.  Darin added some more crayons.  Now Karen has 15 crayons.  How many crayons did Darin add?  \n"
    },
    {
        "iClass":0,
        "iIndex":83,
        "sQuestion":"Five apples fell off the tree.  A squirrel took two apples.  How many apples are left on the ground?  \n"
    },
    {
        "iClass":0,
        "iIndex":84,
        "sQuestion":"2 pumpkins are sitting on a fence.  2 more are placed on the fence.  How many pumpkins are on the fence now?  \n"
    },
    {
        "iClass":0,
        "iIndex":85,
        "sQuestion":"There are 3 horses in the corral.  6 more come along.  How many are there all together?  \n"
    },
    {
        "iClass":0,
        "iIndex":86,
        "sQuestion":"Vanessa has 2 books.  She chose 3 more books.  How many books does she have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":87,
        "sQuestion":"EunJin has 9 lowfat Goldfish crackers.  She ate 5 of them.  How many Goldfish does she have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":88,
        "sQuestion":"Erik had some toy cars.  His friend gave him 4 more.  Now he has 12 altogether.  How many cars did he have to start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":89,
        "sQuestion":"Jill had 3 marbles.  Someone gave her 2 more.  How many does Jill have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":90,
        "sQuestion":"Josue has 5 cars.  More cars were given to him.  Now he has 10.  How many were given to him?  \n"
    },
    {
        "iClass":0,
        "iIndex":91,
        "sQuestion":"Some cookies were on the table.  Six more were placed on the table.   Now there are nine.  How many were on the table in the beginning?  \n"
    },
    {
        "iClass":0,
        "iIndex":92,
        "sQuestion":"Jane picked 7 apples and put them in the basket.  Juan picked some apples and put them in the basket.  Now there are 10 apples in the basket.  How many apples did Juan pick?  \n"
    },
    {
        "iClass":0,
        "iIndex":93,
        "sQuestion":"Some children were reading in the Library.  4 children left.  Now there are 6 children reading in the library.  How many children were reading in the library to begin with?  \n"
    },
    {
        "iClass":0,
        "iIndex":94,
        "sQuestion":"There were 6 kids on the playground.  Some kids went to the nurses office.  Now there are 2.  How many kids went to the nurse?  \n"
    },
    {
        "iClass":0,
        "iIndex":95,
        "sQuestion":"Mary had 4 pencils.  She bought 3 more.  How many pencils does Mary have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":96,
        "sQuestion":"Jack has 3 cookies.  Mary gave him 4 more.  How many cookies does Jack have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":97,
        "sQuestion":"Jack has 3 cookies.  Mary gave him some more.  Now Jack has 7 cookies.  How many did Mary give him?  \n"
    },
    {
        "iClass":0,
        "iIndex":98,
        "sQuestion":"Jack has some bookies.  Mary gave him 3 more.  Now Jack has 7 cookies.  How many cookies did Mary give him?  \n"
    },
    {
        "iClass":0,
        "iIndex":99,
        "sQuestion":"Joe had some candies.  He went trick-or-treating and got 10 more candies.  Now he has 18 candies.  How many candies did he have to start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":100,
        "sQuestion":"We had 15 kids in our room on the 1st day of school.  Now we have 18 kids.  How many new kids came?  \n"
    },
    {
        "iClass":0,
        "iIndex":101,
        "sQuestion":"5 teddy bears came to breakfast. Teddy bear ate 2 pancakes.  How many pancakes did the teddy bears eat altogether?  \n"
    },
    {
        "iClass":0,
        "iIndex":102,
        "sQuestion":"Sally had 3 chocolate chip cookies.  She baked 7 more.  How many does she have now? \n"
    },
    {
        "iClass":0,
        "iIndex":103,
        "sQuestion":"Michael has 5 hot wheels.  Bobby gave him some more.  Now he has 10.  How many hot wheels did Bobby give Michael? \n"
    },
    {
        "iClass":0,
        "iIndex":104,
        "sQuestion":"Loretta planted some flower seeds.  She went to the store and bought 4 more seeds.  Now she has 10 seeds altogether.  How many seeds did she start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":105,
        "sQuestion":"Johnny had 10 crayons.  Rebecca broke two crayons.  How many crayons does Johnny have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":106,
        "sQuestion":"There were 10 children in the cafeteria.  Some got sick.  Now there are 3 children left in the cafeteria.  How many went to the nurses office\n"
    },
    {
        "iClass":0,
        "iIndex":107,
        "sQuestion":"Dudley had some treats.  He ate 9 of them.  Now he has 1 left.  How many treats did he begin with?  \n"
    },
    {
        "iClass":0,
        "iIndex":108,
        "sQuestion":"We have 17 kids in our class.  A new student joined our class.  How many students are in our class now?  \n"
    },
    {
        "iClass":0,
        "iIndex":109,
        "sQuestion":"This morning 14 children were here for the pledge.  At lunch 18 children ate.  How many children came late? \n"
    },
    {
        "iClass":0,
        "iIndex":110,
        "sQuestion":"Our class had some snacks.  Robin brought in 5 more snacks.  Now we have 18.  How many snacks did we start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":111,
        "sQuestion":"We have 19 children in our class.  Four kids went to speech class.  How many kids are left?  \n"
    },
    {
        "iClass":0,
        "iIndex":112,
        "sQuestion":"There are 18 kids in our class.  Some went to the nurse.  Now there are 15 left.  How many went to the nurse?   \n"
    },
    {
        "iClass":0,
        "iIndex":113,
        "sQuestion":"Melissa has 5 M&Ms.  She grabbed 6 M&Ms.  How many does she have altogether?  \n"
    },
    {
        "iClass":0,
        "iIndex":114,
        "sQuestion":"Liz had 5 M&Ms.  She grabbed some more M&Ms.  Now Liz has 11 M&Ms.  How many did she grab?  \n"
    },
    {
        "iClass":0,
        "iIndex":115,
        "sQuestion":"Elizabeth had some M&Ms.  She grabbed 6 from Melissa.  Now she has 11 M&Ms all together.  How many M&Ms did she have to begin with?  \n"
    },
    {
        "iClass":0,
        "iIndex":116,
        "sQuestion":"Melissa had 11 fish.  She gave 5 fish to another class.  How many fish were left?  \n"
    },
    {
        "iClass":0,
        "iIndex":117,
        "sQuestion":"Liz had 11 fish.  She gave some fish to another class.  Now there are 6 fish left in the tank.  How many did she give away?  \n"
    },
    {
        "iClass":0,
        "iIndex":118,
        "sQuestion":"Elizabeth has some fish.  She gave 5 to another class.  Now there are 6 left in her tank.  How many fish did she have to start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":119,
        "sQuestion":"Claudia had 6 mushrooms growing under her tree.  There were 3 more after the rain.  How many mushrooms are there altogether? \n"
    },
    {
        "iClass":0,
        "iIndex":120,
        "sQuestion":"Luis had 6 balls.  His sister gave him some more balls.  Now Luis has 15 balls.  How many balls did his sister give him?  \n"
    },
    {
        "iClass":0,
        "iIndex":121,
        "sQuestion":"Amy had some cookies.  She bought 4 cookies at the store.  Now she has 10 cookies.  How many cookies did she start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":122,
        "sQuestion":"There were 10 monkeys playing at the zoo.  There were 3 climbing on a tree.  How many were not on the tree?  \n"
    },
    {
        "iClass":0,
        "iIndex":123,
        "sQuestion":"There were 8 books on the table.  Someone took some books from the table.  Now there are 3 books on the table.  How many were taken? \n"
    },
    {
        "iClass":0,
        "iIndex":124,
        "sQuestion":"Anissa has some fish.  2 of the fish died.  Now there are 6 fish.  How many fish did she have at first?  \n"
    },
    {
        "iClass":0,
        "iIndex":125,
        "sQuestion":"Mary had 3 friends when she started school.  She makes 5 more friends at school.  How many friends does she have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":126,
        "sQuestion":"Jake had 3 bugs in his bug box.  Roman gave him some more.  Now he has 9 bugs.  How many did Roman give him? \n"
    },
    {
        "iClass":0,
        "iIndex":127,
        "sQuestion":"Jake had some bugs in his bug box.  Roman gave him 6 bugs.  He now has 10 bugs.  How many bugs did Jake start with? \n"
    },
    {
        "iClass":0,
        "iIndex":128,
        "sQuestion":"Addison had 5 crackers for snack.  She gave 2 to Edith.  How many crackers did Addison have left? \n"
    },
    {
        "iClass":0,
        "iIndex":129,
        "sQuestion":"Tiair had some crayons.  She loaned Rune 3 crayons for his project.  Now she has 4 crayons.  How many did she start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":130,
        "sQuestion":"There were 6 children on the climbing wall.  Some children went to the nurse.  Now there are 3 children on the climbing wall.  How many went to the nurse?  \n"
    },
    {
        "iClass":0,
        "iIndex":131,
        "sQuestion":"Tom had 5 marbles.  His friend gave him 3 more.  How many marbles does Tom now have? \n"
    },
    {
        "iClass":0,
        "iIndex":132,
        "sQuestion":"Mary had 2 balloons.  Her friend gave her some more.  Now Mary has 6 balloons.  How many more balloons did her friend give her? \n"
    },
    {
        "iClass":0,
        "iIndex":133,
        "sQuestion":"Some ducks were swimming in a pond.  Two more came.  Now there are 7 ducks swimming.  How many ducks were swimming before the others came? \n"
    },
    {
        "iClass":0,
        "iIndex":134,
        "sQuestion":"Rayven has 3 red bears.  She found 2 blue bears.  How many bears does she have now? \n"
    },
    {
        "iClass":0,
        "iIndex":135,
        "sQuestion":"Billy has 5 apples in his basket.  Suzy gave him some more apples.  Now he has 8 apples.  How many apples did Suzy give Billy? \n"
    },
    {
        "iClass":0,
        "iIndex":136,
        "sQuestion":"Our class has many pumpkins.  Janet brought 4 more this morning.  Now we have 10 pumpkins.  How many did we have before Janet added her pumpkins? \n"
    },
    {
        "iClass":0,
        "iIndex":137,
        "sQuestion":"There were 8 red monsters and 2 went home.  How many monsters are left?  \n"
    },
    {
        "iClass":0,
        "iIndex":138,
        "sQuestion":"There were 7 green monsters.  After the lights went out, there were only 2!  How many are under the bed? \n"
    },
    {
        "iClass":0,
        "iIndex":139,
        "sQuestion":"Mary had some peanuts.  She ate 7 and now she has 5.  How many peanuts did she have at the beginning?  \n"
    },
    {
        "iClass":0,
        "iIndex":140,
        "sQuestion":"Joe had 4 pumpkins.  He picked 3 more pumpkins.  How many does he have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":141,
        "sQuestion":"Joe had 4 pumpkins.  Susan gave him some more.  He has 7 now.  How many did Susan give him?  \n"
    },
    {
        "iClass":0,
        "iIndex":142,
        "sQuestion":"Joe had some pumpkins.  He went to the pumpkin patch and picked 3 more.  Now he has 7 all together.  How many pumpkins did he start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":143,
        "sQuestion":"There were 6 kids on the monkey bars.  3 kids went to the nurse with blisters.  How many kids were left?  \n"
    },
    {
        "iClass":0,
        "iIndex":144,
        "sQuestion":"There were 6 kids on the monkey bars.  Some kids got off.  Now there are 3 kids on the monkey bars.  How many went to the nurse?  \n"
    },
    {
        "iClass":0,
        "iIndex":145,
        "sQuestion":"Joey has 3 pumpkins.  He picks 2 more.  How many pumpkins does he have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":146,
        "sQuestion":"Kate has 2 apples.  Kyle gave her some more apples.  Now Kate has 5 apples.  How many apples did Kyle give her?  \n"
    },
    {
        "iClass":0,
        "iIndex":147,
        "sQuestion":"Mary had some pennies.  She found 3.  Now she has 5.  How many pennies did she start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":148,
        "sQuestion":"There were 6 kindergarteners in the library.  Some went back to the room.  Now there are 4 in the library.  How many kinders went back to the room?  \n"
    },
    {
        "iClass":0,
        "iIndex":149,
        "sQuestion":"Kate has 3 crackers.  She got 4 more crackers.  How many crackers does Kate have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":150,
        "sQuestion":"Julian had 4 cars.  His wife bought him some more cars.  Now Julian has 6 cars.  How many cars did his wife give him?  \n"
    },
    {
        "iClass":0,
        "iIndex":151,
        "sQuestion":"Yvette had some recipe books.  She went to the bookstore and got 5 more books.  Now she has 10 recipe books all together.  How many recipe books did she start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":152,
        "sQuestion":"Alma had some dolls.  She gave 2 to her friend.  She has 5 now.  How many dolls did she start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":153,
        "sQuestion":"There are 3 ghosts in the Haunted House.  2 ghosts fly in the window.  How many ghosts are in the Haunted House?  \n"
    },
    {
        "iClass":0,
        "iIndex":154,
        "sQuestion":"Charlie Brown has 2 pumpkins in his Pumpkin Patch.  Lucy brings him some more.  Now Charlie Brown has 6 pumpkins.  How many pumpkins did Lucy give him?  \n"
    },
    {
        "iClass":0,
        "iIndex":155,
        "sQuestion":"Fred had some Trick or Treat candy.  He went to the next house and got 3 pieces.  Now he has 7 pieces.  How many pieces did Fred have to start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":156,
        "sQuestion":"There were 6 witches stirring the brew.  3 flew away.  How many are still stirring the brew?  \n"
    },
    {
        "iClass":0,
        "iIndex":157,
        "sQuestion":"There were 6 Trick or Treaters in line at the door.  Some got their candy and left.  There are 2 still saying Trick or Treat.  How many already got their candy?  \n"
    },
    {
        "iClass":0,
        "iIndex":158,
        "sQuestion":"John has 3 marbles.  He gets 5 more from his dad.  How many marbles does John have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":159,
        "sQuestion":"Emily has 13 dolls.  She gets 8 more from her friend.  How many dolls does Emily have in all? \n"
    },
    {
        "iClass":0,
        "iIndex":160,
        "sQuestion":"Tim had some baseball cards.  He got 6 more.  Now he has 15 baseball cards.  How many baseball cards did her start with? \n"
    },
    {
        "iClass":0,
        "iIndex":161,
        "sQuestion":"Savannah has some Bratz in her backpack.  Karolina gave her 9 more.  Now she has 25 Bratz.  How many Bratz did she have in her backpack?  \n"
    },
    {
        "iClass":0,
        "iIndex":162,
        "sQuestion":"Juan has 6 crayons in his box.  The teacher gives him 3 more crayons.  How many crayons does he have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":163,
        "sQuestion":"There were 8 bikes on the playground.  4 bikes were being used.  How many bikes are left to play with?  \n"
    },
    {
        "iClass":0,
        "iIndex":164,
        "sQuestion":"Gabriel has 2 pencils.  Robert gave him 8 more.  How many pencils does he have in all?  \n"
    },
    {
        "iClass":0,
        "iIndex":165,
        "sQuestion":"We have 15 grapes in all.  Jack loves grapes and eats most of them.  Now he has 5 grapes.  How many grapes did Jack eat?  \n"
    },
    {
        "iClass":0,
        "iIndex":166,
        "sQuestion":"John brought 5 bananas and gave 1 to Jed.  How many does John have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":167,
        "sQuestion":"Now Anthony brought 4 cookies.  There are 14 cookies.  How many did he bring?  \n"
    },
    {
        "iClass":0,
        "iIndex":168,
        "sQuestion":"Then, Salvador ate 5 cookies.  How many are left?  \n"
    },
    {
        "iClass":0,
        "iIndex":169,
        "sQuestion":"Finally, Angel ate 2 cookies.  There are 6 cookies left.  How many did he have?  \n"
    },
    {
        "iClass":0,
        "iIndex":170,
        "sQuestion":"We planted 10 daffodil bulbs.  Some were eaten by giants.  Only 3 bloomed.   How many were devoured?  \n"
    },
    {
        "iClass":0,
        "iIndex":171,
        "sQuestion":"Megan has some pretzels.  She gave 7 to Sara, now she has 12.  How many pretzels did Megan start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":172,
        "sQuestion":"Paul had 3 toy trucks.  Chris gave him some more and now Paul has 11.  How many did Chris give him?  \n"
    },
    {
        "iClass":0,
        "iIndex":173,
        "sQuestion":"Rebecca had 6 strawberries.  She picked 2 more.  How many strawberries does Rebecca have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":174,
        "sQuestion":"There were 5 starfish on a rock.  Two starfish moved away.  How many starfish are still on the rock?  \n"
    },
    {
        "iClass":0,
        "iIndex":175,
        "sQuestion":"Evan has 3 Scooby Doo stickers.  His mom bought him 4 more.  How many stickers does he have altogether?  \n"
    },
    {
        "iClass":0,
        "iIndex":176,
        "sQuestion":"Hannah is playing with 7 blocks.  She puts 3 away.  How many blocks are left?  \n"
    },
    {
        "iClass":0,
        "iIndex":177,
        "sQuestion":"Rachel had 7 crayons.  She gave 4 away.  How many crayons does she have left?  \n"
    },
    {
        "iClass":0,
        "iIndex":178,
        "sQuestion":"Clarissa has 3 apples.  Francicso gave her 4 apples.  Tori gave her 2 apples.  How many apples does Clarissa have in all? \n"
    },
    {
        "iClass":0,
        "iIndex":179,
        "sQuestion":"There were 7 students in the computer lab.  Some students left.  Now there are 4 students in the computer lab.  How many students left the lab?  \n"
    },
    {
        "iClass":0,
        "iIndex":180,
        "sQuestion":"Marko collected some rocks in the desert for his class science unit.  He gave 7 to Sebastian.  now he only has 9 rocks left.  How many rocks did he collect in the desert?  \n"
    },
    {
        "iClass":0,
        "iIndex":181,
        "sQuestion":"Hussein had 2 pencils.  He got 7 more pencils.  How many pencils does Hussein have now? \n"
    },
    {
        "iClass":0,
        "iIndex":182,
        "sQuestion":"Ten students were on the playground.  Some went inside.  Now there are three students on the playground.  How many students went inside?  \n"
    },
    {
        "iClass":0,
        "iIndex":183,
        "sQuestion":"Mrs. Jacksons 1st grade had 8 lizards (in a habitat).  Tyler discovered 3 in his desk.  How many were left in the habitat?  \n"
    },
    {
        "iClass":0,
        "iIndex":184,
        "sQuestion":"Sara has some M&Ms, she gave 9 to her sister.  She has 4 left.  How many did she have to start?  \n"
    },
    {
        "iClass":0,
        "iIndex":185,
        "sQuestion":"Fabian had 15 cents, Corbin gave him more money.  Fabian now has 20 cents.  How much did Corbin give Fabian?  \n"
    },
    {
        "iClass":0,
        "iIndex":186,
        "sQuestion":"Our class had some books in a basket.  4 children picked out books from the basket.  Now there are 3 books left in the basket.  How many books were in the basket to start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":187,
        "sQuestion":"There are 7 students at the art center.  Some students finished their work and left.  Now there are 4 children at the center.  How many finished their work? \n"
    },
    {
        "iClass":0,
        "iIndex":188,
        "sQuestion":"Sara has 6 marbles.  How many more does she need to make 10?  \n"
    },
    {
        "iClass":0,
        "iIndex":189,
        "sQuestion":"Marissa has 5 rocks.  She gets 3 more rocks.  How many rocks does she have now? \n"
    },
    {
        "iClass":0,
        "iIndex":190,
        "sQuestion":"Al has 13 green apples.  How many more apples does he need to make 20? \n"
    },
    {
        "iClass":0,
        "iIndex":191,
        "sQuestion":"Mom has 2 grocery bags in her hand and 4 more in the car.  How many grocery bags does she have?  \n"
    },
    {
        "iClass":0,
        "iIndex":192,
        "sQuestion":"7 boys were playing on the slide.  2 boys left to play ball.  How many boys are on the slide?  \n"
    },
    {
        "iClass":0,
        "iIndex":193,
        "sQuestion":"Jerry is holding 13 balloons.  Some popped.  Jerry now has 7 balloons.  How many popped?  \n"
    },
    {
        "iClass":0,
        "iIndex":194,
        "sQuestion":"Ricky had 5 marshmallows.  Sara gave him some more.  Now Ricky has 9.  How many marshmallows did Sara give him? \n"
    },
    {
        "iClass":0,
        "iIndex":195,
        "sQuestion":"There are 7 students in the office.  Some students returned to class.  Now there are 3 students in the office.  How many students returned to class?  \n"
    },
    {
        "iClass":0,
        "iIndex":196,
        "sQuestion":"In science, we observed 3 garlic bulbs growing, no potatoes growing, and 5 Brassica plants growing.  How many plants does our class have that are growing? \n"
    },
    {
        "iClass":0,
        "iIndex":197,
        "sQuestion":"Carlos had 6 stars today.  The teacher gave him 8 more stars.  How many stars does he have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":198,
        "sQuestion":"Luis has 8 Valentine cards.  How many more cards does he need to make to have 17 cards?  \n"
    },
    {
        "iClass":0,
        "iIndex":199,
        "sQuestion":"Alicia had 15 chocolates.  She ate some.  Now she has 9 chocolates.  How many chocolates did Alicia eat?  \n"
    },
    {
        "iClass":0,
        "iIndex":200,
        "sQuestion":"Sara had 13 goldfish. She gave 7 away.  How many goldfish does she have left?  \n"
    },
    {
        "iClass":0,
        "iIndex":201,
        "sQuestion":"Billy had 6 hamsters.  He went on vacation and when he returned he found he had 2 new baby hamsters.  How many does he now have?  \n"
    },
    {
        "iClass":0,
        "iIndex":202,
        "sQuestion":"Charlie has 6 guitars.  He wants the entire Les Paul Collection of 12 guitars.  Unfortunately, he is a teacher and a musician and has no money.  But in his dreams, how many more guitars does poor Charlie need?  \n"
    },
    {
        "iClass":0,
        "iIndex":203,
        "sQuestion":"Sheree had 15 Godiva chocolate covered strawberries.  She went to visit Melissa at her home in Ventana Canyon.  When Sherree returned, she had only 7 left.  How many did sneaky Melissa eat?  \n"
    },
    {
        "iClass":0,
        "iIndex":204,
        "sQuestion":"Lizzie has 6 valentines.  Brad gave her 5 more.  How many valentines does Lizzie have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":205,
        "sQuestion":"Sally has 6 dolls.  She received some more for her birthday.  Now she has 15.  How many did she get for her birthday?  \n"
    },
    {
        "iClass":0,
        "iIndex":206,
        "sQuestion":"Kirsten has 15 cupcakes for the party.  She gave 8 to her friends.  How many cupcakes does she have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":207,
        "sQuestion":"Gina has 5 toys left.  She gave Caleb 4 toys.  How many toys did she have to begin with?  \n"
    },
    {
        "iClass":0,
        "iIndex":208,
        "sQuestion":"Kevin had 13 lollipops.  He shared some lollipops with his friends.  Now he has only 5 lollipops left.  How many lollipops did he share?  \n"
    },
    {
        "iClass":0,
        "iIndex":209,
        "sQuestion":"Jerry had some dogs.  He went to the pet shop and got 3 more.  Now he has 11 dogs.  How many dogs did he have to start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":210,
        "sQuestion":"Makayla has 5 candy hearts.  She ate 5.  YUM!  How many hearts does she have left?  \n"
    },
    {
        "iClass":0,
        "iIndex":211,
        "sQuestion":"Pat had 9 puppies.  She now has 4 puppies.  How many got adopted?  \n"
    },
    {
        "iClass":0,
        "iIndex":212,
        "sQuestion":"Julie has 6 stuffed animals.  How many more stuffed animals does she need to have 11?  \n"
    },
    {
        "iClass":0,
        "iIndex":213,
        "sQuestion":"Sarah had 7 candy bars.  She gave 3 away.  How many does she have now? \n"
    },
    {
        "iClass":0,
        "iIndex":214,
        "sQuestion":"Lena has 5 M&Ms.  How many more M&Ms does she need to have 12?  \n"
    },
    {
        "iClass":0,
        "iIndex":215,
        "sQuestion":"George has 6 video games.  He lends 2 of his games to Joey.  How many games does George have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":216,
        "sQuestion":"There were 5 children playing in the park.  2 children had to go home.  How many children were still playing in the park?  \n"
    },
    {
        "iClass":0,
        "iIndex":217,
        "sQuestion":"Sabrina had 10 M&Ms.  She ate some.  Now she has 4 M&Ms.  How many M&Ms did she eat?  \n"
    },
    {
        "iClass":0,
        "iIndex":218,
        "sQuestion":"Sam had 7 fish in his fish tank.  His mom bought him some more fish.  Now he has 15 fish in his tank.  How many fish did his mom give him?  \n"
    },
    {
        "iClass":0,
        "iIndex":219,
        "sQuestion":"Cindy baked some cookies. Later, she baked 12 more cookies.  Now she has 18 cookies for her friends.  How many cookies did she bake the first time?  \n"
    },
    {
        "iClass":0,
        "iIndex":220,
        "sQuestion":"There are 19 students in the class.  Some did not go on the field trip.  14 students went on the field trip.  How many students did not go?  \n"
    },
    {
        "iClass":0,
        "iIndex":221,
        "sQuestion":"John has 4 black rocks and he found 8 red rocks.  How many rocks does John have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":222,
        "sQuestion":"Maria has 12 rocks.  She lost some.  Now she has 7 rocks.  How many did she lose?  \n"
    },
    {
        "iClass":0,
        "iIndex":223,
        "sQuestion":"Alice has 3 pennies.  Linda gave Alice some pennies.  Alice has 10 pennies.  How many pennies did Linda give Alice?  \n"
    },
    {
        "iClass":0,
        "iIndex":224,
        "sQuestion":"There were 4 boys swimming.  2 boys swam away.  How many boys are still swimming?  \n"
    },
    {
        "iClass":0,
        "iIndex":225,
        "sQuestion":"Jesus brought 9 cookies to school.  He gave 4 to his friend Tony.  How many cookies does he have left?  \n"
    },
    {
        "iClass":0,
        "iIndex":226,
        "sQuestion":"Kevin had 11 pennies.  He lost some of them and only has 5 left.  How many pennies did he lose?  \n"
    },
    {
        "iClass":0,
        "iIndex":227,
        "sQuestion":"Jesus has 5 cars.  How many more cars does he need to collect to have 12 cars altogether?  \n"
    },
    {
        "iClass":0,
        "iIndex":228,
        "sQuestion":"Bianca has 10 valentines.  She gave 4 valentines to her friends.  How many valentines does she have left?  \n"
    },
    {
        "iClass":0,
        "iIndex":229,
        "sQuestion":"Vivianna has 8 cookies.  She ate some.  Now she has 2 cookies.  How many cookies did she eat?  \n"
    },
    {
        "iClass":0,
        "iIndex":230,
        "sQuestion":"Joseph needs 10 cars to fill his collection.   He has 6.  How many more does he need?  \n"
    },
    {
        "iClass":0,
        "iIndex":231,
        "sQuestion":"Alyssa has 4 cookies.  Jazmine gives her 5 more.  How many does she have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":232,
        "sQuestion":"Juan had 10 pencils. He gave 3 away to his friend.  How many pencils does Juan have now?  \n"
    },
    {
        "iClass":0,
        "iIndex":233,
        "sQuestion":"There were 9 erasers.  Some were given away.  There are 4 left.  How many erasers were given away?  \n"
    },
    {
        "iClass":0,
        "iIndex":234,
        "sQuestion":"Tara got 4 valentines on Tuesday and 11 more on Wednesday.  How many valentines did she get altogether?  \n"
    },
    {
        "iClass":0,
        "iIndex":235,
        "sQuestion":"Maria found some marbles.  The she got 7 more.  She had 12 marbles altogether.  How many did she find?  \n"
    },
    {
        "iClass":0,
        "iIndex":236,
        "sQuestion":"Nick brought 11 cookies.  Tony ate 5 cookies.  How many cookies did Nick have left?   \n"
    },
    {
        "iClass":0,
        "iIndex":237,
        "sQuestion":"There are 7 boys and 8 girls in our class.  How many Valentines do you need to make all together?  \n"
    },
    {
        "iClass":0,
        "iIndex":238,
        "sQuestion":"There were 15 students in class.  Some students were absent.  Now there are 11 students in class.  How many students are absent?  \n"
    },
    {
        "iClass":0,
        "iIndex":239,
        "sQuestion":"Clara had 15 bandanas.  Marcus gave her some more for our class round-up.  Now Clara has 22 bandanas.  How many bandanas did Marcus give her?  \n"
    },
    {
        "iClass":0,
        "iIndex":240,
        "sQuestion":"On our field trip to the Rock Museum, we bought some rocks.  We gave 10 to Mrs. Jaramillos class.  Now we have 30 rocks.  How many rocks did we buy?  \n"
    },
    {
        "iClass":0,
        "iIndex":241,
        "sQuestion":"Jesus has 9 seeds and planted 5.  How many does Jesus have to plant now?  \n"
    },
    {
        "iClass":0,
        "iIndex":242,
        "sQuestion":"Ashley bought 5 pieces of gum.  Her friend gave her 5 more.  How many does she have now? \n"
    },
    {
        "iClass":0,
        "iIndex":243,
        "sQuestion":"Don has 8 seeds.  He planted some of the seeds.  Now he has 5 seeds left.  How many did he plant?  \n"
    },
    {
        "iClass":0,
        "iIndex":244,
        "sQuestion":"Janessa has 4 bean plants.  How many more bean plants does she need to have 15 all together?  \n"
    },
    {
        "iClass":0,
        "iIndex":245,
        "sQuestion":"10 children are playing outside.  Some go to the bathroom.  4 are still playing outside.  How many went to the bathroom?  \n"
    },
    {
        "iClass":0,
        "iIndex":246,
        "sQuestion":"Kathy has some pretzels.  She bought two.  Now she has 8.  How many did she start with?  \n"
    },
    {
        "iClass":0,
        "iIndex":247,
        "sQuestion":"Taiwan had 8 cookies. He gave 3 of them to Bear. How many cookies does Taiwan have now? \n"
    },
    {
        "iClass":0,
        "iIndex":248,
        "sQuestion":"Taiwan gave 3 cookies to Bear. He started with 8 cookies. How many cookies does Taiwan have now?\n"
    },
    {
        "iClass":0,
        "iIndex":249,
        "sQuestion":"Bear had 5 cookies. Taiwan gave him 8 more. How many cookies does Bear have now?\n"
    },
    {
        "iClass":0,
        "iIndex":250,
        "sQuestion":"Bear had some cookies. Taiwan gave him 8 more. Then she had 13 cookies. How many cookies did Bear have before Taiwan gave him any?\n"
    },
    {
        "iClass":0,
        "iIndex":251,
        "sQuestion":"Bear had 7 cookies. She gave 4 to Taiwan. How many cookies does Bear have now? \n"
    },
    {
        "iClass":0,
        "iIndex":252,
        "sQuestion":"Taiwan had 8 cookies. He gave some to Bear. Now he has 5 cookies. How many cookies did Taiwan give to Bear?\n"
    },
    {
        "iClass":0,
        "iIndex":253,
        "sQuestion":"Taiwan had some cookies. He gave 3 cookies to Bear. Then he had 5 cookies left. How many cookies did Taiwan have before sharing with Bear? \n"
    },
    {
        "iClass":0,
        "iIndex":254,
        "sQuestion":"D.W. has 5 books. Arthur gives her 5 more. How many books does D.W. have now?\n"
    },
    {
        "iClass":0,
        "iIndex":255,
        "sQuestion":"D.W. had 4 books. Then, Mom bought her some more. Now D.W. has 8 books. How many books did Mom buy D.W.?\n"
    },
    {
        "iClass":0,
        "iIndex":256,
        "sQuestion":"D.W. had some coins in her bank. Then, she found three coins on the sidewalk. Now she has 6 coins. How many coins did D.W. have to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":257,
        "sQuestion":"Arthur had 12 books. He gave 6 to do. How many books does Arthur have now?\n"
    },
    {
        "iClass":0,
        "iIndex":258,
        "sQuestion":"Arthur had 14 coins. He spent some coins on ice cream. When he got home, he had 7 coins. How many coins did Arthur spend on ice cream?\n"
    },
    {
        "iClass":0,
        "iIndex":259,
        "sQuestion":"Arthur had some books in his room. Then, he gave D.W. 9 books. Now he has 9 books. How many books did Arthur have to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":260,
        "sQuestion":"Frog raked 2 piles of leaves. Then, he raked 5 more. How many piles of leaves did Frog rake in all?\n"
    },
    {
        "iClass":0,
        "iIndex":261,
        "sQuestion":"There are 6 trees in Toads yard. Frog planted some more trees for Toads birthday. Now there are 13 trees in Toads yard. How many trees did Frog plant?\n"
    },
    {
        "iClass":0,
        "iIndex":262,
        "sQuestion":"Frog had some tools in his garden shed. Then, Toad gave him 4 more tools for his birthday. Now Frog has 10 tools. How many tools did Frog have to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":263,
        "sQuestion":"There are 15 piles of leaves for Frog to rake. He raked 4 of them. How many piles does Frog have left to rake?\n"
    },
    {
        "iClass":0,
        "iIndex":264,
        "sQuestion":"There were 8 piles of leaves in Toads yard. Frog raked some of the piles for Toad. Now there are 5 piles in Toads yard. How many piles did Frog rake for him?\n"
    },
    {
        "iClass":0,
        "iIndex":265,
        "sQuestion":"Frog needed to rake piles of leaves. Toad raked 4 piles for him. Now Frog has 12 piles left to rake. How many piles were there to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":266,
        "sQuestion":"Henry bought Mudge 4 collars. Then, he had to buy 3 more. How many collars did Henry buy for Mudge in all?\n"
    },
    {
        "iClass":0,
        "iIndex":267,
        "sQuestion":"Mudge ate 7  bowls of dog food. Then, he ate some more bowls of dog food. Now he has eaten 12 bowls of dog food. How many bowls did Mudge eat the first time?\n"
    },
    {
        "iClass":0,
        "iIndex":268,
        "sQuestion":"There were some dogs at the pet shop. Then, 7 more dogs came. Now there are 15 dogs at the pet shop. How many dogs were there to begin with?\n"
    },
    {
        "iClass":0,
        "iIndex":269,
        "sQuestion":"Henry is walking dogs for money. There are 7 dogs to walk on Henrys street. Henry walked 4 of them. How many dogs does Henry have left to walk?\n"
    },
    {
        "iClass":0,
        "iIndex":270,
        "sQuestion":"Henry had 13 dog bones. Mudge ate some of them. Now there are 9 dog bones. How many bones did Mudge eat?\n"
    },
    {
        "iClass":0,
        "iIndex":271,
        "sQuestion":"Henry bought a lot of collars for Mudge. Mudge grew out of 4 collars. There are 15 collars left. How many collars did Henry buy to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":272,
        "sQuestion":"Sue had 2 pets. Then, she adopted 4 more pets. How many pets doe s Sue have now?\n"
    },
    {
        "iClass":0,
        "iIndex":273,
        "sQuestion":"Bobs dog had 8 puppies. They sold some puppies. Now there are 3 puppies left. How many puppies did Bob sell?\n"
    },
    {
        "iClass":0,
        "iIndex":274,
        "sQuestion":"Jims dog had some puppies. He gave 8 puppies to his friends. Now he has 5 puppies left. How many puppies did Jims dog have to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":275,
        "sQuestion":"Patty is going to throw the Frisbee 10 times for her dog. She has already thrown it 5 times. How many more times will Patty throw the Frisbee?\n"
    },
    {
        "iClass":0,
        "iIndex":276,
        "sQuestion":"Joe had 15 dog bones. His dog ate some of them. Now there are 9 bones. How many bones did Joes dog eat?\n"
    },
    {
        "iClass":0,
        "iIndex":277,
        "sQuestion":"Kim bought some balls for her dog. They lost 7 balls at the park. Now there are 4 balls left. How many balls did Kim buy to start with?\n"
    },
    {
        "iClass":0,
        "iIndex":278,
        "sQuestion":"Joe brought 5 books back to the library. Emma brought 6 books back to the library. How many books did they bring back in all?\n"
    },
    {
        "iClass":0,
        "iIndex":279,
        "sQuestion":"The library was missing 15 books. People brought back some of the books. Now the library is only missing 4 books. How many books were returned?\n"
    },
    {
        "iClass":0,
        "iIndex":280,
        "sQuestion":"The soccer team had won a lot of games. They won 3 games this week. Now they have won 17 games. How many games had they won before this week?\n"
    },
    {
        "iClass":0,
        "iIndex":281,
        "sQuestion":"Amy is going to bake 15 cookies for the bake sale. She has already baked 7 cookies. How many more cookies does Amy need to bake?\n"
    },
    {
        "iClass":0,
        "iIndex":282,
        "sQuestion":"Sally had 18 brownies for sale at the bake sale. People bought some of her brownies. Now she has 8 brownies left. How many brownies did people buy?\n"
    },
    {
        "iClass":0,
        "iIndex":283,
        "sQuestion":"The soccer team got some new shirts. They gave 12 shirts to players. Now there are 3 shirts left. How many shirts did the soccer team get to start?\n"
    },
    {
        "iClass":0,
        "iIndex":284,
        "sQuestion":"5 kids were playing soccer. 7 more joined them. How many kids are playing soccer now?\n"
    },
    {
        "iClass":0,
        "iIndex":285,
        "sQuestion":"The team had 5 points. Then, Mia scored some more goals. Now they have 9 points. How many goals did Mia score?\n"
    },
    {
        "iClass":0,
        "iIndex":286,
        "sQuestion":"Mias brothers and sister were playing soccer. Then, 3 friends joined them. Now there are 8 kids playing soccer. How many of Mias brothers and sisters are playing?\n"
    },
    {
        "iClass":0,
        "iIndex":287,
        "sQuestion":"Mia had 7 posters. She gave 5 to Lovdy. How many posters does Mia have now?\n"
    },
    {
        "iClass":0,
        "iIndex":288,
        "sQuestion":"9 kids were playing soccer. Then, some went home. Now there are 5 kids playing soccer. How many kids left?\n"
    },
    {
        "iClass":0,
        "iIndex":289,
        "sQuestion":"There were some soccer balls in a tub. Mia took 4 balls. Now there are 8 balls in the tub. How many balls did Mia take?\n"
    },
    {
        "iClass":0,
        "iIndex":290,
        "sQuestion":"Sally picks 6 apples from the tree. She buys another bag with 5 apples in it. How many apples did Sally get?\n"
    },
    {
        "iClass":0,
        "iIndex":291,
        "sQuestion":"Jack had 7 apples. Jill had 6 apples. Together they have how many apples?\n"
    },
    {
        "iClass":0,
        "iIndex":292,
        "sQuestion":"There were 12 apples on the tree. Mary picked 7 apples. How many apples were left on the tree?\n"
    },
    {
        "iClass":0,
        "iIndex":293,
        "sQuestion":"I had a bag of 15 apples. 6 apples fell out on the way home. How many were left in the bag when I got home?\n"
    },
    {
        "iClass":0,
        "iIndex":294,
        "sQuestion":"Grandma was making applesauce. She had 14 apples. She peeled 8 apples. How many apples did she have left over? \n"
    },
    {
        "iClass":0,
        "iIndex":295,
        "sQuestion":"Mom made 5 pumpkin pies. She made more on Sunday. Then she had 7 in all. How many did she make on Sunday?\n"
    },
    {
        "iClass":0,
        "iIndex":296,
        "sQuestion":"How many Yodas flew away from the planet in the space shuttle if 23 Yodas stayed on the planet of 30 Yodas in all?\n"
    },
    {
        "iClass":0,
        "iIndex":297,
        "sQuestion":"The captain just added 3 spaceships. Then, they had 10. How many spaceships did they start with?\n"
    },
    {
        "iClass":0,
        "iIndex":298,
        "sQuestion":"The astronaut just added 16 bags of food to the cupboard. Then, they had 40 bags. How many bags of food were in the cupboard when he started?\n"
    },
    {
        "iClass":0,
        "iIndex":299,
        "sQuestion":"Mrs. Maxwell had 8 pencils. Mr. Lord gave her some more. Now she has 18 pencils. How many did Mr. Lord give her?\n"
    },
    {
        "iClass":0,
        "iIndex":300,
        "sQuestion":"Mrs. McMillan has a kinder class.  She sent 5 children to the specialist.  She now has 13 children in class.  How many did she start with?  "
    }
]